def convert():
    user_num = input("Введите число")
    spisok = ["mm", "cm", "km", "dm", "m", "nm"]
    print(spisok)
    user_tw = input("Выберите единицу")
    user_fr = input("Выберите единицу")
    spisok2 = [{'единица измерения': 'm', 'множитель': 1},
               {'единица измерения': 'mm', 'множитель': 0.001},
               {'единица измерения': 'cm', 'множитель': 0.01},
               {'единица измерения': 'km', 'множитель': 1000},
               {'единица измерения': 'nm', 'множитель': 0.000000001}
               ]

    for c in spisok2:
        if user_tw==c['единица измерения']:
            user_th=c['множитель']
    print(user_th)        